-- phpMyAdmin SQL Dump
-- version 4.4.14
-- http://www.phpmyadmin.net
--
-- 主機: 127.0.0.1
-- 產生時間： 2016-01-03 19:40:10
-- 伺服器版本: 5.6.26
-- PHP 版本： 5.6.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `ec011`
--

-- --------------------------------------------------------

--
-- 資料表結構 `designer`
--

CREATE TABLE IF NOT EXISTS `designer` (
  `識別碼` int(20) NOT NULL,
  `預約時間` varchar(30) NOT NULL,
  `設計師名稱` varchar(50) NOT NULL,
  `設計師自我介紹` varchar(100) NOT NULL,
  `設計師圖檔` varchar(20) NOT NULL,
  `設計師名額` int(20) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 資料表的匯出資料 `designer`
--

INSERT INTO `designer` (`識別碼`, `預約時間`, `設計師名稱`, `設計師自我介紹`, `設計師圖檔`, `設計師名額`) VALUES
(1, '中午', '李柏皜', '你好，我考過證照是丙級的，希望你給我機會來檢你的狗的毛', '3.PNG', 4),
(2, '中午', '林佳嘉', '我很細心，可以剪你家狗的毛，我真的是一級棒的', '', 2),
(3, '早上', '柯明章', '很厲害是個老手，在裡面是最老的', '3.jpg', 0),
(4, '早上', '李姿穎', '評價最高，很多人指定設計師', '4.jpg', 0),
(5, '早上', '音速小子', '剪最快，適合趕時間的人來做', '5.jpg', 0),
(6, '早上', '小倉鼠', '頭腦很好，客人要求什麼奇怪造型一定可以相似度100%', '6.jpg', 0),
(7, '早上', '塔爾斯', '裡面最帥的，是很多女顧客的最愛也最常光顧', '7.jpg', 0),
(8, '中午', '小叮噹', '有很多法寶，可以變出很多花樣', '8.jpg', 0),
(9, '中午', '野比大雄', '很粗心，評價最低但價錢也最低時常請小叮噹來幫忙', '9.jpg', 0),
(10, '中午', '許育誠', '丙級證照，優良服務', '10.jpg', 0),
(11, '中午', '史迪奇', '微笑對人，服務品質好，掛保證', '11.jpg', 0),
(12, '中午', '蛋黃哥', '很懶惰，但慢工出細活', '12.jpg', 0),
(13, '中午', '奧蘭多', '剪的髮型很特殊，脾氣大，但對人算不錯的', '13.jpg', 0),
(14, '中午', '費歐娜', '是個公主，有公主病，只喜歡幫看得順眼的客人剪頭髮', '14.jpg', 0),
(15, '晚上', '史瑞克', '很man，但是個女生，非常厲害的傢伙', '15.jpg', 0),
(16, '晚上', '小毛驢', '是個小人物，但是很認真負責', '', 0),
(17, '晚上', '小賈斯汀', '很娘，但是是個重要角色，考過無數證照，經驗佳', '17.jpg', 0),
(18, '晚上', '晚上', '乙級證照，優良服務', '18.jpg', 0),
(19, '晚上', '楊過', '優良服務，很愛老顧戶', '19.jpg', 0),
(20, '晚上', '小比比', '丙級證照、優良服務、演過電影', '20.jpg', 0),
(21, '晚上', '小王子', '本店萬人民，看到人時常微笑、時常榮獲本店模範設計師', '21.jpg', 0),
(22, '中午', '小白兔', '可愛蒙眼睛', '22.jpg', 6),
(23, '2', '35', '', '', 0);

-- --------------------------------------------------------

--
-- 資料表結構 `designreservation`
--

CREATE TABLE IF NOT EXISTS `designreservation` (
  `帳號` varchar(30) NOT NULL,
  `設計師名稱` varchar(20) NOT NULL,
  `預約時間` varchar(20) NOT NULL,
  `是否有任何意見` varchar(200) NOT NULL,
  `性別` varchar(15) NOT NULL,
  `預約名額` int(11) NOT NULL,
  `預約表單送出時間` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 資料表的匯出資料 `designreservation`
--

INSERT INTO `designreservation` (`帳號`, `設計師名稱`, `預約時間`, `是否有任何意見`, `性別`, `預約名額`, `預約表單送出時間`) VALUES
('1234', '李柏皜', '早上', '', '男', 1, '2016-01-02 01:14:07'),
('1234', '李柏皜', '早上', '22222', '男', 1, '2016-01-02 03:06:41'),
('1234', 'ddd', '早上', 'ssssss', '男', 1, '2016-01-02 03:41:45'),
('andy', '李柏皜', '早上', 'eeeeee', '女', 1, '2016-01-02 04:50:04'),
('1234', '小白兔', '中午', '想早一點', '男', 1, '2016-01-02 13:26:39'),
('1234', '李柏皜', '中午', 'eeee', '男', 1, '2016-01-02 17:50:48');

-- --------------------------------------------------------

--
-- 資料表結構 `member`
--

CREATE TABLE IF NOT EXISTS `member` (
  `帳號` varchar(30) NOT NULL,
  `密碼` varchar(30) NOT NULL,
  `姓名` varchar(30) NOT NULL,
  `信箱` varchar(30) NOT NULL,
  `地址` varchar(30) NOT NULL,
  `電話` varchar(20) NOT NULL,
  `生日` varchar(20) NOT NULL,
  `性別` varchar(20) NOT NULL,
  `權限` int(20) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 資料表的匯出資料 `member`
--

INSERT INTO `member` (`帳號`, `密碼`, `姓名`, `信箱`, `地址`, `電話`, `生日`, `性別`, `權限`) VALUES
('11', '1234', '比比', 'ydnaush@msn.com', '', '0920301912', '1915-2-7', '男', 1),
('1234', '2345', '1234', 'ydnaush53@gmail.com', '台北市', '0920301912', '1916-3-3', '男', 0),
('andy', '123', 'andy', 'ydnaush55@gmail.com', '台北市', '0920301912', '1992-12-29', '女', 1);

-- --------------------------------------------------------

--
-- 資料表結構 `message`
--

CREATE TABLE IF NOT EXISTS `message` (
  `識別碼` varchar(50) NOT NULL,
  `商品代號` varchar(20) NOT NULL,
  `商品名稱` varchar(50) NOT NULL,
  `信箱` varchar(30) NOT NULL,
  `性別` varchar(10) NOT NULL,
  `留言主旨` varchar(20) NOT NULL,
  `留言內容` varchar(100) NOT NULL,
  `留言時間` date NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 資料表的匯出資料 `message`
--

INSERT INTO `message` (`識別碼`, `商品代號`, `商品名稱`, `信箱`, `性別`, `留言主旨`, `留言內容`, `留言時間`) VALUES
('CA0142', 'CA01', '1234', ' ydnaush53@gmail.com', '', 'eeee', 'eeee', '2016-01-03'),
('CA0152', 'CA01', '1234', ' ydnaush53@gmail.com', '男', 'qq', 'qq', '2016-01-03');

-- --------------------------------------------------------

--
-- 資料表結構 `news`
--

CREATE TABLE IF NOT EXISTS `news` (
  `識別碼` int(20) NOT NULL,
  `標題` varchar(20) NOT NULL,
  `內文` varchar(100) NOT NULL,
  `圖片` varchar(200) NOT NULL,
  `日期` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 資料表的匯出資料 `news`
--

INSERT INTO `news` (`識別碼`, `標題`, `內文`, `圖片`, `日期`) VALUES
(1, '冬至吃湯圓，買衣服', '冬天冷給，狗狗們著裝，要趕快了，全面半價', '1.jpg', '2015-12-17 12:30:29'),
(2, '網站建置中', '準備開店了，還正在完工網頁，需要2-5個工作天，\r\n請大家見諒', '2.jpg', '2015-12-19 13:58:29'),
(3, '排行榜更新中', '正在準備排行榜的討論', '3.jpg', '2015-12-20 00:08:30'),
(4, '天氣好多出去玩', '有沒有想出去玩，但不知要去哪裡玩，趕快來找我們玩喔', '4.jpg', '2015-12-20 00:11:00'),
(5, '天氣好', '好玩的東西準備上市', '5.jpg', '2015-12-25 00:00:00'),
(6, 'www', 'wwww', '6.PNG', '2016-01-02 01:12:18'),
(7, 'eee', 'eeeee', '3.PNG', '2016-01-02 06:19:29'),
(8, 'rrrrr', 'rrr', '2.PNG', '2016-01-02 06:20:02'),
(9, 'ssss', 'ssss', '6.jpg', '2016-01-02 13:33:24'),
(10, '88', '888', 'CIMG0558.JPG', '2016-01-04 00:56:37');

-- --------------------------------------------------------

--
-- 資料表結構 `question`
--

CREATE TABLE IF NOT EXISTS `question` (
  `識別碼` varchar(30) NOT NULL,
  `主題` varchar(20) NOT NULL,
  `簡單描述` varchar(100) NOT NULL,
  `圖檔` varchar(30) NOT NULL,
  `發文帳號` varchar(40) NOT NULL,
  `最後上傳日期` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 資料表的匯出資料 `question`
--

INSERT INTO `question` (`識別碼`, `主題`, `簡單描述`, `圖檔`, `發文帳號`, `最後上傳日期`) VALUES
('1', '寵物不見了', '在三重區，請大家協尋', '', '1234', '2016-01-04 01:47:11');

-- --------------------------------------------------------

--
-- 資料表結構 `shopcategory`
--

CREATE TABLE IF NOT EXISTS `shopcategory` (
  `商品代號` varchar(20) NOT NULL,
  `商品名稱` varchar(40) NOT NULL,
  `單價` int(20) NOT NULL,
  `優惠價` int(20) NOT NULL,
  `詳細資料` varchar(400) NOT NULL,
  `圖檔` varchar(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 資料表的匯出資料 `shopcategory`
--

INSERT INTO `shopcategory` (`商品代號`, `商品名稱`, `單價`, `優惠價`, `詳細資料`, `圖檔`) VALUES
('88', '88', 88, 888, '888', '0.png'),
('AA', 'aa', 0, 0, 'aa', 'CIMG0558.JPG'),
('CA01', '肉醬佐雞肉罐', 35, 0, '精選高品質的羊肉、牛肉、雞肉醬汁的美味組合，三種肉醬罐加上雞肉及野菜、起司、雞肝，豐富的組合，嗜口性佳，能幫助愛犬成長發育。', '7.png'),
('CA02', '貴族精緻狗餐盒', 30, 0, '澳洲原裝口味多元不膩食，優質素材即開即食。添加寡糖低脂保健關節。全低脂配方，小型成犬每餐一罐。', '28.png'),
('CA03', '西莎牛肉經典餐盒', 32, 0, '營養完整風味獨特的西莎經典餐盒，特選最上等的新鮮材料及精緻配菜，並保留原汁精華營養，風味絕佳。每一口都是精心調製，極致享受，一餐一盒，新鮮又美味，是狗狗最愛的選擇。', '8.png'),
('CA04', '寵物廚房無穀狗罐頭', 35, 0, '臺灣生產，健康無穀物，低升醣食材，易開罐拉環，七種精緻口味。', '9.png'),
('CA05', 'ADDICTION鮭魚馬鈴薯狗罐', 140, 0, '寵物食品是由純正天然、全面護理及低過敏配方精心配製而成，可改善您寵物的健康與活力。', '26.png'),
('CA06', 'UsDog 愛犬澳洲機能餐罐', 38, 0, '精選高品質的羊肉、牛肉、雞肉的美味組合，純淨無污染的肉源，豐富的組合，嗜口性佳，能幫助愛犬成長發育。', '25.png'),
('CA07', 'PURE．貓咪巧鮮杯', 27, 0, '貼心設計的盒裝,易開不割手,添加肌膚,關節滋補配方,魚膠原蛋白,每杯熱量低於30卡,讓寶貝吃的美味,營養滿分加倍不發胖。', '39.png'),
('CA08', '高齡貓專用餐罐', 1299, 0, '同年齡的罐頭內容物做出不同的細碎程度,保護皮膚、維持視力健康。', '40.png'),
('CA09', '高齡貓專用餐罐(小)', 55, 0, '同年齡的罐頭內容物做出不同的細碎程度,保護皮膚、維持視力健康。', '41.png'),
('CA10', '韓國MONGE．水果養生湯罐80g', 199, 0, '採用嫩雞之低脂雞胸肉,香甜可口水果,腸益菌配方-維持消化道機能,重量：每罐80g。', '42.png'),
('CA11', '寵物廚房．無穀低升醣狗罐120g', 750, 0, '通過ISO22000 HACCP認證, 精選新鮮肉塊,慢燉精製,健康無穀物,低升醣食材。', '43.png'),
('CA12', '美國Natural Balance．全素主食狗罐', 120, 0, '針對家禽,海鮮肉源蛋白過敏愛犬設計的專用配方,不添加玉米,大豆,小麥等引起過敏反應的附產品;適合犬種：全犬種適用。', '44.png'),
('CA13', '倍力康BELICOM．營養滿點狗罐', 499, 0, '採用低脂鮮嫩雞肉，無添加防腐劑，吃的健康有活力,容量:80g,產地:泰國。', '45.png'),
('CA14', 'SEEDS．愛犬機能燉飯料理餐罐', 35, 0, '大塊肉塊、米飯佐以鮮美湯汁，完美的調配絕對是狗狗的最愛，375g超大份量，滿足狗狗愛吃的天性，提供好動寶貝一天在外頭奔跑足夠的熱量，產地：泰國。', '46.png'),
('CA15', '23', 12, 5, 'wwwww', '6.png'),
('CL01', '閒綠帽短外套', 479, 0, '時尚兼具保暖連帽短外套，超舒適純棉毛質感， 高質感布料與手工鏽花，衣上有兩個造型小口袋及鏽花布，精緻感獨特的設計 ，穿上後讓你的狗狗成為外出時注目的焦點。', '10.png'),
('CL02', 'MsPET．新款寵物毛衣(L號)', 199, 0, '毛衣是寵物在秋冬必備的保暖商品之一，具伸縮性,溫暖包覆,居家外出穿毛衣最適合了,L號:脖圍24~40cm 胸圍36~50cm 背長40cm。', '47.png'),
('CL03', 'MsPET．新款寵物毛衣(SS號)', 199, 0, '毛衣是寵物在秋冬必備的保暖商品之一，具伸縮性,溫暖包覆,居家外出穿毛衣最適合了,SS號 脖圍20cm 胸圍32cm 衣長約21cm。', '48.png'),
('CL04', 'MsPET．新款寵物毛衣(2L號)', 199, 0, '毛衣是寵物在秋冬必備的保暖商品之一，具伸縮性,溫暖包覆,居家外出穿毛衣最適合了,2L號:脖圍32~46cm 胸圍40~56cm 背長46cm。', '49.png'),
('CL05', 'MsPET．新款寵物毛衣(M號)', 199, 0, '毛衣是寵物在秋冬必備的保暖商品之一，具伸縮性,溫暖包覆,居家外出穿毛衣最適合了,M號:脖圍30~38cm 胸圍40~54cm 背長33~36cm。', '50.png'),
('CL06', 'MsPET．新款寵物毛衣(S號)', 199, 0, '毛衣是寵物在秋冬必備的保暖商品之一，具伸縮性,溫暖包覆,居家外出穿毛衣最適合了,L號:脖圍24~40cm 胸圍36~50cm 背長44cm。', '51.png'),
('CL07', '可愛寵物毛衣(S號)', 180, 0, '毛衣是寵物在秋冬必備的保暖商品之一，具伸縮性,溫暖包覆,居家外出穿毛衣最適合了,S號:脖圍24~34cm 胸圍34~42cm 背長29公分。', '52.png'),
('CL08', '可愛寵物毛衣(2L號)', 199, 0, '毛衣是寵物在秋冬必備的保暖商品之一，具伸縮性,溫暖包覆,居家外出穿毛衣最適合了,2L號:脖圍32~46cm 胸圍40~56cm 背長46cm。', '53.png'),
('F01', '赫緻烘焙無穀火雞肉健康糧', 749, 450, '低溫壓榨之亞麻仁籽油，可充分保持其活性與營養，對狗狗整體的健康非常重要，可促進血液循環、維持心血管及心臟健康、增進毛髮健康亮麗，可減輕發炎反應、抗過敏\r\n', '1.png'),
('F02', '吉沛思．小動物酵素營養錠片80錠', 280, 280, '專為小動物量身調配，內含木瓜酵素(papain)、啤酒酵母 (Brewer''s Yeast)能有效分解食物。', '31.png'),
('F03', '紐崔斯養生火雞無穀犬配方', 1249, 625, '新鮮肉類及魚類蛋白質，不含穀類，減少過敏原。 20%的蔬果精華及多種滋補草本植物能抗氧化。高達8種益生菌及益菌生，照顧腸胃並幫助吸收。\r\n', '23.png'),
('F04', '紐崔斯天然糧六種魚配方', 1049, 0, '使用高優質的去骨黑線鱈、去骨鱈魚、去骨綠鱈、去骨比目魚、鯡魚肉粉，提供高優質的魚類蛋白以及支持所需的生理機能。\r\n', '24.png'),
('F05', '紐崔斯天然糧火雞肉乾糧', 899, 0, '使用高優質的火雞肉，提供高優質的蛋白以及支持所需的生理機能，豐富多樣性的田園蔬菜水果，增強犬隻的免疫功能 。\r\n', '2.png'),
('F06', '無穀火雞肉低敏配方', 959, 0, '採用去骨新鮮火雞肉，均衡維持體態，能促進免疫系統，維持能量均衡\r\n', '21.png'),
('F07', '核心有機素食天然犬糧', 750, 0, '國際有機認證的素食飼料，針對需要低蛋白、低脂肪及低過敏源配方的狗兒短暫時期的食用。\r\n', '3.png'),
('F08', '美國柏萊富【無穀雞肉豌豆天然犬糧15磅】', 1750, 0, '柏萊富Blackwood 為WDJ 2013推薦天然糧，以分批的方式慢火烹煮確保食品的高品質，高優質全天然雞肉蛋白質，最容易消化吸收。\r\n', '29.png'),
('F09', '希爾思．強化飼料', 1480, 0, '美國第一品牌希爾思，專為有毛球問題的成貓設計 ，自然植物纖維幫助毛球排除 ；富含牛磺酸，保護心臟、視網膜 ；美味且形狀獨特的顆粒 。\r\n\r\n', '30.png'),
('F10', '烘焙客無穀犬雞肉', 1049, 0, '加拿大在地生產，新鮮加拿大去骨野放雞、大西洋深海鮭魚、紐西蘭大草原鮮嫩羊肉、鯊魚軟骨素 ，全天然黑麥及糙米，精心挑選優質食材。\r\n', '22.png'),
('FF', 'ff', 0, 0, 'ff', '0.png'),
('GO01', '小漫遊推車', 2990, 0, '包覆式座艙，提供狗兒安心舒適的環境，低重心設計，讓推車在行進間仍維持重心與穩定。', '14.png'),
('GO02', '輕旅行狗兒推車', 3300, 0, '獨家設計車架可快速收合，不占空間，材質輕巧，攜帶方便，特級鋁合金材質手把，伸縮流暢，採用厚網格，耐抓不易破損。', '15.png'),
('GO03', '地平線平拉式箱車211', 4599, 0, '快速收合，不占空間，內建置物袋可擺放寵物小用品。', '18.png'),
('GO04', 'Pettio雙層式推車107T', 5950, 0, '雙層座艙，獨立空間，多隻寵物一同出遊也能優雅閒適，改良式網格設計，維持上下座艙空氣流通與良好視野，組裝簡單快速，不用工具也能輕鬆收納。', '19.png'),
('GO05', 'Pettio寵物時光412P', 5899, 0, '載重最大的分離式寵物推車，承重20公斤，隨時可分離為寵物箱包與車架，讓你的外出旅遊、搭乘大眾交通工具或汽車更方便頂棚可180度後拉，即使外出散步，狗兒也不會離開你的視線。', '20.png'),
('GO06', '日本IRIS．汽車安全帶PDH-S(S號)', 789, 0, '可當成胸背袋使用S號適合6公斤以內狗狗使用,耐拉力高達32公斤。', '60.png'),
('GO07', '日本MARUKAN【DC-158藍色/DC-157紅色 L號】', 1760, 0, '特殊的流線設計 及側邊的通風口讓您的愛犬愛貓在久也不會窒息,商品尺寸：寬390x長610x高365mm適用對象：適用於 小中型犬種使用。', '61.png'),
('GO08', '日本MARUKAN《DP-684 輕巧摺疊可攜帶狗籠L號 咖啡色》', 2850, 0, '可使用於家中,或外出旅遊也非常方便 商品規格: 長81 寬57 高62公分 適用對象:中大型犬都適用。', '62.png'),
('GO09', 'DAB．685W1活力海洋簡單條紋風', 520, 0, '適合頸圍40-63cm，胸圍58-90cm之大型犬用。', '63.png'),
('LI01', '木製兩用寵物圍籠', 4200, 0, '針對小型犬 幼犬，及小型犬種設計的圍欄式狗籠組，搭配粉體粗烤漆線，掛上食架或水壺也很安穩，是高雅大方的多用途寵物屋。', '11.png'),
('LI02', '中小型室內外犬屋', 4200, 0, '精緻市內外ABS樹脂狗屋，清洗容易，附門，門可拆懈，屋內兩側面有通氣孔，通風良好，適合中、小型犬種。', '12.png'),
('LI03', '海瀨造型睡窩', 1650, 0, '小型狗狗及貓兒最愛的圓型睡窩，粉嫩軟絨質，內中間墊可當獨取出，厚實布質柔軟舒適，顏色造型大方， 材質柔軟舒適厚實的棉布能有效隔離冷空氣，保持內部的溫暖，有效隔離地氣。 可水洗，重複使用。底部是防滑材質 。', '13.png'),
('LI04', 'IRIS快適犬屋KI-660', 2950, 0, 'PVC塑膠樹脂材質，清洗整理容易，底部通風可取出清理。放置室內外皆可。柴犬等中小型犬種適合。顏色沉穩，穩重安定，可全屋水洗。', '17.png'),
('LI05', 'IRIS戶外犬屋950', 6950, 0, '膠樹脂材質，清洗整理容易。放置房外，雙向推門式，也可將狗關起來，或開門當作休息固定點。中型犬種適合。門間隙可另購防蟲網，高級感狗屋，穩重安定。', '16.png'),
('LI06', '日本Marukan．三用迷彩遊戲窩 ', 599, 0, '貓咪及小型犬皆適用 ,袋狀設計可讓貓咪鑽進去休息兼玩躲貓貓,商品尺寸：W350×D350×H420mm。', '54.png'),
('LI07', '日本IRIS．千鳥格子摺疊沙發床M號', 799, 0, '使用抗靜電材質,乾燥天氣也不怕 ,墊子打開空間瞬間加大,尺寸：長69*寬49*高14cm。', '55.png'),
('LI08', '日本IRIS．千鳥格子方型兩用睡窩 M號 ', 980, 0, '山洞式睡窩,有獨立隱密空間,讓寵物更有安全感,尺寸：長40*寬40*高40cm。', '56.png'),
('LI09', '日本Marukan．貓咪保溫墊 ', 880, 0, '在寒冷的日子,毛絨材質舒適墊子,倍感溫暖~內有專用加熱器設置,可開啟加熱溫度,商品規格：保暖墊長40cm*寬90cm。', '57.png'),
('LI10', '日本IRIS．千鳥格子方型兩用睡窩 S號 ', 740, 0, '日本最新設計床款,採包覆方型設計,觸感極佳的絨布材質,讓寶貝在裡頭安心舒適,尺寸：長32*寬32*高32cm。', '58.png'),
('LI11', '日本IRIS．千鳥格子貓咪睡窩 M號 ', 899, 0, '日本最新設計床款,採包覆方型設計,觸感極佳的絨布材質,讓寶貝在裡頭安心舒適,尺寸：長55*寬55*高29cm。', '59.png'),
('QQ', 'qq', 0, 0, 'qq', 'CIMG0558.JPG'),
('S01', 'GooToe 軟Q雞肉骨', 9, 0, '以鮮嫩雞肉為主要配方，增加嗜口性，並添加各種營養素提供健康所需。 低脂、富含膳食纖維幫助消化、促進腸胃蠕動。‧不含人工色素、香料及防腐劑。', '27.png'),
('S02', '蔬菜潔牙骨', 6, 0, '以雞肉為主要配方，增加嗜口性，並添加各種營養素提供健康所需。低脂、富含膳食纖維幫助消化、促進腸胃蠕動。不含人工色素、香料及防腐劑。', '4.png'),
('S03', '香軟細牛皮捲', 85, 0, '全天然牛皮製成，絕不添加化學成份，且多添加超濃郁的牛奶口味，大大增進狗狗的食慾。 有效降低防止狗狗亂咬物品的情形發生、還有抗憂鬱及解憂之效果讓狗狗打發無聊的時間。', '5.png'),
('S04', '黃金香脆里雞肉片', 189, 0, '鯊魚軟骨素配方，增強抵抗力是補充愛犬營養 的最佳點心食品，新鮮美味適口性極佳，營養豐富，適合各種大小犬種。', '6.png'),
('S05', '駿寶．寵物鼠美味磨牙棒', 130, 0, '滿足咀嚼啃咬的天性，將外層包裹的穀物吃完後，原木還可以當作啃木使用。', '32.png'),
('S06', '美國8 in 1．長毛貓專用化毛膏0230-70克(M719)', 280, 0, '嗜口性極佳麥芽口味，可避免毛髮在消化系統累積阻塞。', '33.png'),
('S07', '日本MARUKAN．木天蓼', 89, 0, '讓貓咪放鬆身心。', '34.png'),
('S08', 'PetBest．百憂解有機貓薄荷草20g', 170, 0, '有機栽培天然貓薄荷草，增進貓咪的食慾並可幫助貓咪腸胃蠕動,促進腸胃的健康,排出毛球。', '35.png'),
('S09', '鮮味小舖．貓咪零食系列35g', 109, 0, '100%日本漁港產地直送製造，使用新鮮漁貨所製作，口感鮮美，嗜口性佳。', '36.png'),
('S10', 'CooToe．3吋蔬菜軟Q雞肉打結骨', 99, 0, '新纖雞肉製成,無人工添加,低脂低鹽。', '37.png'),
('S11', '沛滋露．犬用角切起司塊80g', 110, 0, '超香濃的特製低卡洛里乳酪起司塊，幫助狗狗骨骼及牙齒發育的優質零食。', '38.png');

-- --------------------------------------------------------

--
-- 資料表結構 `訂單`
--

CREATE TABLE IF NOT EXISTS `訂單` (
  `訂單編號` varchar(80) NOT NULL,
  `訂購人帳號` varchar(20) NOT NULL,
  `商品名稱` varchar(50) NOT NULL,
  `商品數量` int(20) NOT NULL,
  `商品價格` int(100) NOT NULL,
  `合計` int(20) NOT NULL,
  `出貨狀況` varchar(20) NOT NULL,
  `取貨日期` varchar(40) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 資料表的匯出資料 `訂單`
--

INSERT INTO `訂單` (`訂單編號`, `訂購人帳號`, `商品名稱`, `商品數量`, `商品價格`, `合計`, `出貨狀況`, `取貨日期`) VALUES
('123443', '1234', '西莎牛肉經典餐盒', 1, 32, 32, '缺貨中', '2017-1-3'),
('andy82', 'andy', '肉醬佐雞肉罐', 1, 35, 35, '缺貨中', '2016-1-1');

--
-- 已匯出資料表的索引
--

--
-- 資料表索引 `designer`
--
ALTER TABLE `designer`
  ADD PRIMARY KEY (`識別碼`);

--
-- 資料表索引 `designreservation`
--
ALTER TABLE `designreservation`
  ADD PRIMARY KEY (`預約表單送出時間`);

--
-- 資料表索引 `member`
--
ALTER TABLE `member`
  ADD PRIMARY KEY (`帳號`);

--
-- 資料表索引 `message`
--
ALTER TABLE `message`
  ADD PRIMARY KEY (`識別碼`),
  ADD KEY `識別碼` (`識別碼`);

--
-- 資料表索引 `news`
--
ALTER TABLE `news`
  ADD PRIMARY KEY (`識別碼`);

--
-- 資料表索引 `question`
--
ALTER TABLE `question`
  ADD PRIMARY KEY (`識別碼`);

--
-- 資料表索引 `shopcategory`
--
ALTER TABLE `shopcategory`
  ADD PRIMARY KEY (`商品代號`);

--
-- 資料表索引 `訂單`
--
ALTER TABLE `訂單`
  ADD PRIMARY KEY (`訂單編號`);

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
